12/data/attachments/a7d5de46d56536e.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_cade49a0-d31e-482a-b58c-40693a53e945</nif:username>
            <nif:friendToBeAdded>Seth_message_Friend_42350_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>